11/data/attachments/e2e0638d3849612c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:username>
            <nif:friendToBeAdded>Richard_now_Friend_35620_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>